request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://com.soap/app/producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getAllAddressRequest/>
   </soapenv:Body>
</soapenv:Envelope>

